Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/examiners_office.html.txt.tmx
Source language: en
Languages: ga

source: The Examiner supervises the liquidation of companies
ga: Riarann an scrúdaitheoir scaoileadh comhalachtaí

source: deals with accounts and inquiries,
ga: Ag plé le cuntais agus le fiosrúcháin,

source: settles lists of creditors,
ga: Réitíonn sé líostaí creidiúnaithe,

source: arranges sales of properties,
ga: Réitíonn sé margadh tithe agus talúna,

source: countersigns all payments and investments,
ga: Comhshíníonn sé gach íocaíocht agus gach fuilleamh,

source: processes applications for the court,
ga: Próiseálann sé gach iarratas don chúirt,

source: acts as Registrar to the court assigned to deal with matters proceeding before the Examiner (the "Examiner's List"),
ga: Bíonn mar Chláraitheoir don Chúirt maidir le nithe a thagann chuig oifig an Scrúdaitheora le fiosrú ("Liosta an Scrúdaitheora"),

source: processes applications for bankruptcy,
ga: Próiseálann sé gach iarratas clisiúnais,
